## Plan Result (ptl-jenkins)




<pre><code>Plan: 10 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.logicappsecret
  * module.jenkins-webhook-relay.azurerm_api_connection.connection
  * module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow
  * module.jenkins-webhook-relay.azurerm_resource_group.azure_resource_group
  * module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment
  * module.jenkins-webhook-relay.module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.jenkins-webhook-relay.module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue.servicebus_queue
  * module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
* Update
  * azurerm_cosmosdb_sql_container.container[&#34;cve-reports&#34;]
  * azurerm_cosmosdb_sql_container.container[&#34;performance-metrics&#34;]
  * azurerm_cosmosdb_sql_container.container[&#34;pipeline-metrics&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_sql_container.container["cve-reports"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "container" {
        id                    = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics/sqlDatabases/jenkins/containers/cve-reports"
        name                  = "cve-reports"
        # (6 unchanged attributes hidden)

      ~ indexing_policy {
            # (1 unchanged attribute hidden)

          - included_path {
              - path = "/*" -> null
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_cosmosdb_sql_container.container["performance-metrics"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "container" {
        id                    = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics/sqlDatabases/jenkins/containers/performance-metrics"
        name                  = "performance-metrics"
        # (6 unchanged attributes hidden)

      ~ indexing_policy {
            # (1 unchanged attribute hidden)

          - included_path {
              - path = "/*" -> null
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_cosmosdb_sql_container.container["pipeline-metrics"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "container" {
        id                    = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics/sqlDatabases/jenkins/containers/pipeline-metrics"
        name                  = "pipeline-metrics"
        # (6 unchanged attributes hidden)

      ~ indexing_policy {
            # (1 unchanged attribute hidden)

          - included_path {
              - path = "/*" -> null
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_key_vault_secret.logicappsecret will be created
  + resource "azurerm_key_vault_secret" "logicappsecret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.KeyVault/vaults/ptl"
      + name                    = "github-jenkins-ptl-logicapp"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.jenkins-webhook-relay.azurerm_api_connection.connection will be created
  + resource "azurerm_api_connection" "connection" {
      + display_name        = (known after apply)
      + id                  = (known after apply)
      + managed_api_id      = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/providers/Microsoft.Web/locations/uksouth/managedApis/servicebus"
      + name                = "github-sb-jenkins-con"
      + parameter_values    = (known after apply)
      + resource_group_name = "github-jenkins-sds-ptl-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow will be created
  + resource "azurerm_logic_app_workflow" "logic_app_workflow" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "github-jenkins-ptl"
      + resource_group_name             = "github-jenkins-sds-ptl-rg"
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
      + workflow_version                = "1.0.0.0"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.jenkins-webhook-relay.azurerm_resource_group.azure_resource_group will be created
  + resource "azurerm_resource_group" "azure_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "github-jenkins-sds-ptl-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment will be created
  + resource "azurerm_resource_group_template_deployment" "logic_app_deployment" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "logic-app-deployment"
      + output_content      = (known after apply)
      + parameters_content  = jsonencode(
            {
              + commonTags      = {
                  + value = "eyJhcHBsaWNhdGlvbiI6ImNvcmUiLCJidWlsdEZyb20iOiJobWN0cy9zZHMtamVua2lucy1pbmZyYXN0cnVjdHVyZSIsImJ1c2luZXNzQXJlYSI6IkNyb3NzLUN1dHRpbmciLCJjcml0aWNhbGl0eSI6IkhpZ2giLCJlbnZpcm9ubWVudCI6InByb2R1Y3Rpb24ifQ=="
                }
              + location        = {
                  + value = "UK South"
                }
              + logic_app_name  = {
                  + value = "github-jenkins-ptl"
                }
              + subscription_id = {
                  + value = "6c4d2513-a873-41b4-afdd-b05a33206631"
                }
            }
        )
      + resource_group_name = "github-jenkins-sds-ptl-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + outputs        = {
                  + callbackUrl = {
                      + type  = "String"
                      + value = "[listCallbackURL(resourceId('Microsoft.Logic/workflows/triggers', parameters('logic_app_name'), 'manual'), '2017-07-01').value]"
                    }
                }
              + parameters     = {
                  + commonTags      = {
                      + defaultValue = ""
                      + type         = "string"
                    }
                  + location        = {
                      + defaultValue = "uksouth"
                      + type         = "string"
                    }
                  + logic_app_name  = {
                      + defaultValue = ""
                      + type         = "string"
                    }
                  + rg              = {
                      + defaultValue = ""
                      + type         = "string"
                    }
                  + sb_con_name     = {
                      + defaultValue = "github-sb-jenkins-con"
                      + type         = "string"
                    }
                  + subscription_id = {
                      + defaultValue = ""
                      + type         = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-07-01"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('logic_app_name')]"
                      + properties = {
                          + definition = {
                              + "$schema"      = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
                              + actions        = {
                                  + Compose      = {
                                      + inputs   = "@triggerBody()"
                                      + runAfter = {}
                                      + type     = "Compose"
                                    }
                                  + Response     = {
                                      + inputs   = {
                                          + headers    = {
                                              + Content-Type = "application-json"
                                            }
                                          + statusCode = 200
                                        }
                                      + kind     = "Http"
                                      + runAfter = {
                                          + Send_message = [
                                              + "Succeeded",
                                            ]
                                        }
                                      + type     = "Response"
                                    }
                                  + Send_message = {
                                      + inputs   = {
                                          + body   = {
                                              + ContentData = "@{base64(outputs('Compose'))}"
                                              + ContentType = "text/plain"
                                            }
                                          + host   = {
                                              + connection = {
                                                  + name = "@parameters('$connections')['servicebus_1']['connectionId']"
                                                }
                                            }
                                          + method = "post"
                                          + path   = "/@{encodeURIComponent(encodeURIComponent('test'))}/messages"
                                        }
                                      + runAfter = {
                                          + Compose = [
                                              + "Succeeded",
                                            ]
                                        }
                                      + type     = "ApiConnection"
                                    }
                                }
                              + contentVersion = "1.0.0.0"
                              + outputs        = {}
                              + parameters     = {
                                  + "$connections" = {
                                      + defaultValue = {}
                                      + type         = "Object"
                                    }
                                }
                              + triggers       = {
                                  + manual = {
                                      + inputs = {
                                          + schema = {
                                              + properties = {
                                                  + action       = {
                                                      + type = "string"
                                                    }
                                                  + after        = {
                                                      + type = "string"
                                                    }
                                                  + before       = {
                                                      + type = "string"
                                                    }
                                                  + enterprise   = {
                                                      + properties = {
                                                          + avatar_url  = {
                                                              + type = "string"
                                                            }
                                                          + created_at  = {
                                                              + type = "string"
                                                            }
                                                          + description = {
                                                              + type = "string"
                                                            }
                                                          + html_url    = {
                                                              + type = "string"
                                                            }
                                                          + id          = {
                                                              + type = "integer"
                                                            }
                                                          + name        = {
                                                              + type = "string"
                                                            }
                                                          + node_id     = {
                                                              + type = "string"
                                                            }
                                                          + slug        = {
                                                              + type = "string"
                                                            }
                                                          + updated_at  = {
                                                              + type = "string"
                                                            }
                                                          + website_url = {
                                                              + type = "string"
                                                            }
                                                        }
                                                      + type       = "object"
                                                    }
                                                  + number       = {
                                                      + type = "integer"
                                                    }
                                                  + organization = {
                                                      + properties = {
                                                          + avatar_url         = {
                                                              + type = "string"
                                                            }
                                                          + description        = {
                                                              + type = "string"
                                                            }
                                                          + events_url         = {
                                                              + type = "string"
                                                            }
                                                          + hooks_url          = {
                                                              + type = "string"
                                                            }
                                                          + id                 = {
                                                              + type = "integer"
                                                            }
                                                          + issues_url         = {
                                                              + type = "string"
                                                            }
                                                          + login              = {
                                                              + type = "string"
                                                            }
                                                          + members_url        = {
                                                              + type = "string"
                                                            }
                                                          + node_id            = {
                                                              + type = "string"
                                                            }
                                                          + public_members_url = {
                                                              + type = "string"
                                                            }
                                                          + repos_url          = {
                                                              + type = "string"
                                                            }
                                                          + url                = {
                                                              + type = "string"
                                                            }
                                                        }
                                                      + type       = "object"
                                                    }
                                                  + pull_request = {
                                                      + properties = {
                                                          + _links                = {
                                                              + properties = {
                                                                  + comments        = {
                                                                      + properties = {
                                                                          + href = {
                                                                              + type = "string"
                                                                            }
                                                                        }
                                                                      + type       = "object"
                                                                    }
                                                                  + commits         = {
                                                                      + properties = {
                                                                          + href = {
                                                                              + type = "string"
                                                                            }
                                                                        }
                                                                      + type       = "object"
                            

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

d_events_url = {
                                                                      + type = "string"
                                                                    }
                                                                  + repos_url           = {
                                                                      + type = "string"
                                                                    }
                                                                  + site_admin          = {
                                                                      + type = "boolean"
                                                                    }
                                                                  + starred_url         = {
                                                                      + type = "string"
                                                                    }
                                                                  + subscriptions_url   = {
                                                                      + type = "string"
                                                                    }
                                                                  + type                = {
                                                                      + type = "string"
                                                                    }
                                                                  + url                 = {
                                                                      + type = "string"
                                                                    }
                                                                }
                                                              + type       = "object"
                                                            }
                                                          + private                     = {
                                                              + type = "boolean"
                                                            }
                                                          + pulls_url                   = {
                                                              + type = "string"
                                                            }
                                                          + pushed_at                   = {
                                                              + type = "string"
                                                            }
                                                          + releases_url                = {
                                                              + type = "string"
                                                            }
                                                          + size                        = {
                                                              + type = "integer"
                                                            }
                                                          + ssh_url                     = {
                                                              + type = "string"
                                                            }
                                                          + stargazers_count            = {
                                                              + type = "integer"
                                                            }
                                                          + stargazers_url              = {
                                                              + type = "string"
                                                            }
                                                          + statuses_url                = {
                                                              + type = "string"
                                                            }
                                                          + subscribers_url             = {
                                                              + type = "string"
                                                            }
                                                          + subscription_url            = {
                                                              + type = "string"
                                                            }
                                                          + svn_url                     = {
                                                              + type = "string"
                                                            }
                                                          + tags_url                    = {
                                                              + type = "string"
                                                            }
                                                          + teams_url                   = {
                                                              + type = "string"
                                                            }
                                                          + topics                      = {
                                                              + items = {
                                                                  + type = "string"
                                                                }
                                                              + type  = "array"
                                                            }
                                                          + trees_url                   = {
                                                              + type = "string"
                                                            }
                                                          + updated_at                  = {
                                                              + type = "string"
                                                            }
                                                          + url                         = {
                                                              + type = "string"
                                                            }
                                                          + visibility                  = {
                                                              + type = "string"
                                                            }
                                                          + watchers                    = {
                                                              + type = "integer"
                                                            }
                                                          + watchers_count              = {
                                                              + type = "integer"
                                                            }
                                                          + web_commit_signoff_required = {
                                                              + type = "boolean"
                                                            }
                                                        }
                                                      + type       = "object"
                                                    }
                                                  + sender       = {
                                                      + properties = {
                                                          + avatar_url          = {
                                                              + type = "string"
                                                            }
                                                          + events_url          = {
                                                              + type = "string"
                                                            }
                                                          + followers_url       = {
                                                              + type = "string"
                                                            }
                                                          + following_url       = {
                                                              + type = "string"
                                                            }
                                                          + gists_url           = {
                                                              + type = "string"
                                                            }
                                                          + gravatar_id         = {
                                                              + type = "string"
                                                            }
                                                          + html_url            = {
                                                              + type = "string"
                                                            }
                                                          + id                  = {
                                                              + type = "integer"
                                                            }
                                                          + login               = {
                                                              + type = "string"
                                                            }
                                                          + node_id             = {
                                                              + type = "string"
                                                            }
                                                          + organizations_url   = {
                                                              + type = "string"
                                                            }
                                                          + received_events_url = {
                                                              + type = "string"
                                                            }
                                                          + repos_url           = {
                                                              + type = "string"
                                                            }
                                                          + site_admin          = {
                                                              + type = "boolean"
                                                            }
                                                          + starred_url         = {
                                                              + type = "string"
                                                            }
                                                          + subscriptions_url   = {
                                                              + type = "string"
                                                            }
                                                          + type                = {
                                                              + type = "string"
                                                            }
                                                          + url                 = {
                                                              + type = "string"
                                                            }
                                                        }
                                                      + type       = "object"
                                                    }
                                                }
                                              + type       = "object"
                                            }
                                        }
                                      + kind   = "Http"
                                      + type   = "Request"
                                    }
                                }
                            }
                          + parameters = {
                              + "$connections" = {
                                  + value = {
                                      + servicebus_1 = {
                                          + connectionId   = "[resourceId('Microsoft.Web/connections', parameters('sb_con_name'))]"
                                          + connectionName = "servicebus-connection"
                                          + id             = "[subscriptionResourceId('Microsoft.Web/locations/managedApis', parameters('location'), 'servicebus')]"
                                        }
                                    }
                                }
                            }
                          + state      = "Enabled"
                        }
                      + tags       = "[variables('tags')]"
                      + type       = "Microsoft.Logic/workflows"
                    },
                ]
              + variables      = {
                  + tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.jenkins-webhook-relay.module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be created
  + resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      + capacity                            = 0
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "uksouth"
      + minimum_tls_version                 = (known after apply)
      + name                                = "github-jenkins-ptl"
      + public_network_access_enabled       = true
      + resource_group_name                 = "github-jenkins-sds-ptl-rg"
      + sku                                 = "Standard"
      + tags                                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + zone_redundant                      = false
    }

  # module.jenkins-webhook-relay.module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule will be created
  + resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "SendAndListenSharedAccessKey"
      + namespace_id                      = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "github-jenkins-ptl"
      + resource_group_name                 = "github-jenkins-sds-ptl-rg"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue.servicebus_queue will be created
  + resource "azurerm_servicebus_queue" "servicebus_queue" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + dead_lettering_on_message_expiration    = true
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT10M"
      + enable_batched_operations               = true
      + enable_express                          = false
      + enable_partitioning                     = false
      + id                                      = (known after apply)
      + lock_duration                           = "PT1M"
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "jenkins"
      + namespace_id                            = (known after apply)
      + requires_duplicate_detection            = false
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

Plan: 10 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":33,"Program":"tfcmt","SHA1":"","Target":"ptl-jenkins","Vars":{}} -->